Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/changes_that_can_affect_your_social_welfare_payment.html.txt.tmx
Source language: en
Languages: ga

source: Changes that can affect your social welfare payment
ga: Athruithe ar féidir tionchar a bheith acu ar d'íocaíocht leasa shóisialaigh

source: If you are getting a social welfare payment and your personal circumstances change you must contact the Department of Social Protection
ga: Má tá íocaíocht leasa shóisialaigh á fáil agat agus má thagann athrú ar do chúinsí pearsanta, ba chóir duit dul i dteagmháil leis an Roinn Coimirce Sóisialaí

source: A change in your circumstances can mean you get an increase or a decrease in your social welfare payment
ga: D'fhéadfá méadú nó laghdú a fháil i d'íocaíocht leasa shóisialaigh mar gheall ar athrú i do chúinsí pearsanta

source: You could even be entitled to an extra or different social welfare payment
ga: D'fhéadfá bheith i dteideal íocaíocht leasa shóisialaigh bhreise nó difriúil a fháil

source: Contacting the Department will mean you get your increase faster or avoid repaying overpayments
ga: Má dhéanann tú teagmháil leis an Roinn, gheobhaidh tú d'íocaíocht níos tapúla nó seachnóidh tú aisíoc na n-íocaíochtaí iomarcaí

source: A change in your personal circumstances may mean you qualify for a social welfare payment for the first time
ga: Mar gheall ar athrú i do chúinsí pearsanta, d'fhéadfá a bheith i dteideal íocaíocht leasa shóisialaigh a fháil don chéad uair

source: For example, if you were working and recently lost your job, you may be entitled to Jobseeker's Benefit or Jobseeker's Allowance
ga: Mar shampla, más rud é go raibh tú ag obair agus gur chaill tú do phost le déanaí, féadann tú a bheith incháilithe i gcomhair Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist

source: If you are in private rented accommodation you may also qualify for Rent Supplement
ga: Sa chás seo, má tá tú i gcóiríocht phríobháideach ar cíos, féadann tú bheith incháilithe chomh maith i gcomhair Fhordheontas Cíosa

source: Read more about losing your job
ga: Tá tuilleadh eolais faoi do phost a chailliúint anseo

source: Sometimes, there can be a change in your personal circumstances but you don't qualify for a social welfare payment
ga: Uaireanta, tar éis athruithe i do chúinsí pearsanta ní bhíonn tú incháilithe le haghaidh íocaíocht leasa shóisialaigh

source: In this case, you may qualify for Supplementary Welfare Allowance
ga: Sa chás seo féadfaidh tú a bheith i dteideal Liúntas Leasa Forlíontach a fháil

source: For example, if your employer does not pay you when you are out of work sick, but you don't qualify for Illness Benefit, you may qualify for Supplementary Welfare Allowance
ga: Mar shampla, mura n-íocfaidh d'fhostóir tú agus tú tinn as obair, ach mura bhfuil tú incháilithe le haghaidh Sochar Tinnis, féadfaidh tú a bheith i dteideal Liúntas Breise Leasa Shóisialaigh a fháil

source: You can also read more about Rent Supplement and changes to your circumstances
ga: Tá tuilleadh eolais faoi Forlíonadh Cíosa agus athruithe ar do chúinsí

source: Changes meaning you qualify for additional social welfare payments
ga: Athruithe a cháilíonn tú i gcomhair íocaíochtaí leasa shóisialaigh breise

source: A change in your personal circumstances may mean you qualify for an additional social welfare payment
ga: Mar gheall ar athrú i do chúinsí pearsanta, d'fhéadfá bheith i dteideal íocaíocht leasa shóisialaigh bhreise a fháil

source: For example, if you are getting a One-Parent Family Payment and get a job for at least 19 hours a week, you may be able to claim Family Income Supplement (FIS)
ga: Cuir i gcás go bhfaigheann tú Íocaíocht do Theaghlach Aontuismitheora, agus má fhaigheann tú post 19 uair in aghaidh na seachtaine ar a laghad, d’fhéadfá iarratas a dhéanamh ar Fhorlíonadh Ioncam Teaghlaigh (FIT)

source: Changes meaning you qualify for a different social welfare payment
ga: Athruithe a cháilíonn tú i gcomhair íocaíocht leasa shóisialaigh difriúil

source: A change in your circumstances may mean you no longer qualify for the payment you are currently getting but qualify for a different payment
ga: Mar gheall ar athrú i do chúinsí, féadfaidh tú a bheith docháilithe le haghaidh íocaíocht a fhaigheann tú faoi láthair ach féadfaidh tú a bheith incháilithe le aghaidh íocaíocht dhifriúil

source: In some cases, you may be financially better off on the different payment
ga: I gcásanna áirithe, d'fhéadfá a bheith i dteideal níos mó airgid leis an íocaíocht dhifriúil

source: For example, Domiciliary Care Allowance is no longer paid when the person being cared for reaches 16 years of age
ga: Mar shampla, ní íoctar an Liúntas Cúram Baile a thuilleadh nuair a shroicheann an duine atá faoi chúram 16 bliana d'aois

source: However, the person with the disability can apply for Disability Allowance, which is paid at a higher rate than Domiciliary Care Allowance
ga: Ach is féidir leis an duine míchumasaithe cur isteach ar Liúntas Míchumais, agus íoctar é sin ag ráta níos airde ná Liúntas Cúram Baile

source: Changes meaning you qualify for a reduced social welfare payment
ga: Athruithe a cháilíonn tú i gcomhair íocaíocht leasa shóisialaigh laghdaithe

source: If you or your spouse, civil partner or cohabitant take up employment or get income or capital from any other source, it may reduce your payment
ga: Má chuireann tusa nó do chéile nó do pháirtí cuid den Pinsean Stáitse (Neamh-Ranníocach) i dtaisce gach seachtain, tógfar na coigiltis seo san áireamh mar chuid de d'acmhainní

source: If you or your spouse, civil partner or cohabitant save a portion of your State Pension (Non-Contributory) each week, these savings will be taken into account as means
ga: Tá sé tábhachtach an Roinn Coimirce Sóisialaí a chur ar an eolas faoi na coigiltis seo chun íocaíocht iomarcach agus aisíoc na híocaíochta iomarcaí ina dhiaidh sin a sheachaint

source: Changes meaning you no longer qualify for a social welfare payment
ga: Athruithe a dhícháilíonn tú ó íocaíocht leasa shóisialaigh atá agat

source: A change in your circumstances may mean you no longer qualify for a social welfare payment
ga: Mar gheall ar athrú i do chúinsí tá seans ann nach bhfuil tú incháilithe a thuilleadh i gcomhair íocaíocht leasa shóisialaigh

source: For example, you are not entitled to Widow's, Widower's or Surviving Civil Partner's Pension if you remarry or enter into a new civil partnership or cohabit with someone else
ga: Mar shampla, níl tú incháilithe an Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh a fháil má athphósann tú, má déanann tú páirtnéireacht shibhialta nua nó má chónaíonn tú le duine mar fhear céile agus bean chéilí

source: It is a criminal offence to claim a social welfare payment, if you know you are not entitled to it. You can be prosecuted for claiming a social welfare payment that you are no longer entitled to
ga: Is cion coiriúl é íocaíocht leasa shóisialaigh a éileamh, má tá a fhios agat nach bhfuil tú i dteideal í a fháil.Is féidir tú a ionchúiseamh as íocaíocht leasa shóisialaigh a éileamh nach bhfuil ag dul duit a thuilleadh

source: Changes automatically made to your social welfare payment
ga: Athruithe a dhéantar go huathoibríoch ar d'íocaíocht leasa shóisialaigh

source: In some cases, the Department of Social Protection will automatically change your social welfare payment to reflect changes in your personal circumstances
ga: I gcásanna áirithe, athróidh an Roinn Coimirce Sóisialaí d'íocaíocht leasa shóisialaigh go huathoibríoch chun na hathruithe i do chúinsí pearsanta a thaispeáint

source: For example, if you are getting a social welfare payment, you will automatically get an increase in your payment when you are 80 years of age
ga: Mar shampla, má tá tú íocaíocht leasa shóisialaigh á fáil agat, gheobhaidh tú méadú go huathoibríoch nuair a shroichfidh tú 80 bliain d'aois

source: However, in most cases you must contact the Department of Social Protection when your circumstances change
ga: I bhformhór na gcásanna áfach, ní mór duit dul i dteagmháil leis an Roinn Coimirce Sóisialaí nuair a athraíonn do chúinsí pearsanta

source: In some cases, if you qualify for more than one payment you will have to choose the one that is of most benefit to you
ga: I gcásanna áirithe, má tá tú i dteideal níos mó ná íocaíocht amháin a fháil, ní mór duit an ceann is tairbhí duit a roghnú

source: For example, though you may qualify for Illness Benefit it may be of greater benefit for you to claim Disability Allowance because of the additional benefits, such as Fuel Allowance, the Living Alone Increase and the Household Benefits Package
ga: Cuir i gcás go bhfuil tú i dteideal Sochar Tinnis a fháil, tá seans ann go mbeadh sé níos tairbhí duit Liúntas Míchumais a éileamh mar gheall ar na sochair bhreise ar nós Liúntas um Chónaí Aonair agus an Pacáiste Sochar Teaghlaigh

source: You can get help and advice on which social welfare payment you qualify for and which is of most benefit to you from your Intreo centre or social welfare local office and your local Citizens Information Service
ga: Féadfaidh d'Ionad Intreo ó d'oifig leasa shóisialaigh áitiúil agus d'Ionad Faisnéise do Shaoránaigh áitiúil cabhair agus comhairle a thabhairt duit maidir leis an íocaíocht leasa shóisialaigh a bhfuil tú incháilithe di agus cé acu is tairbhí duit
